Configuration/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Catalogs/Организации/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ЗначениеЗаполнено(ИНН) Тогда
		Возврат;
	КонецЕсли;

	ТребуемаяДлинаИНН = 0;
	Если ТипОрганизации = Перечисления.ТипыОрганизаций.ЮридическоеЛицо Тогда
		ТребуемаяДлинаИНН = 10;
	ИначеЕсли ТипОрганизации = Перечисления.ТипыОрганизаций.ИндивидуальныйПредприниматель Тогда
		ТребуемаяДлинаИНН = 12;
	КонецЕсли;

	Если ТребуемаяДлинаИНН > 0 И СтрДлина(СокрЛП(ИНН)) <> ТребуемаяДлинаИНН Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон("ИНН должен содержать %1 символов для выбранного типа организации.", ТребуемаяДлинаИНН),
			ЭтотОбъект,
			"ИНН",
			,
			Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
